Repository: Nejc-Podlogar/tabornski_sos_prirocnik_frontend
Catalog: lib/l10n/intl_*.arb
Languages: sl

# appTitle
source: Scouts S.O.S Manual
sl: Taborniški S.O.S Priročnik

source: Read more
sl: Preberi več

source: Coming soon
sl: Prihaja kmalu

source: Begin
sl: Začni

# introApplication
source: The application is primarily intended for scouts who want to learn the Morse and Semaphore alphabets and practice their knowledge of orientation. The application contains a translator, dictionary, learning materials and exercises. It also includes the possibility of learning topography. The application is designed to be easy to use and allows learning in various ways.
sl: Aplikacija je namenjena predvsem tabornikov, ki se želijo naučiti morsejeve in semaforjeve abecede ter povaditi znanje iz orientacije. Aplikacija vsebuje prevajalnik, slovar, gradiva za učenje in vaje. Vsebuje tudi možnost učenja topografije. Aplikacija je zasnovana tako, da je enostavna za uporabo in omogoča učenje na različne načine.

# introMorseCode
source: In the Morse code alphabet you have several different tools available. You have a translator to and from Morse code. You can transmit translated text via the flashlight on your phone. There are also learning materials available, which you can also download to your device. You can also train on customized exercises to improve your knowledge of morse code.
sl: Pri morsejevi abecedi imate na voljo več različnih orodij. Na voljo vam je prevajalnik v morsejevo abecedo in iz nje. Prevedeno besedilo lahko oddajate preko bliskavice na telefonu. Na voljo pa so vam tudi gradiva za učenje, katera lahko prenesete tudi na svojo napravo. Lahko tudi vadite morsejevo abecedo s pomočjo prilagodljivih vaj in tako izboljašate svoje znanje.

# introSemaphore
source: In the Semaphore alphabet you have several different tools available. You have a translator to and from Semaphore. There are also learning materials available, which you can also download to your device. There is also a separate list for all the characters and special symbols.
sl: Pri semaforjevi abecedi imate na voljo več različnih orodij. Na voljo vam je prevajalnik v semaforjevo abecedo in iz nje. Na voljo pa so vam tudi gradiva za učenje, katera lahko prenesete tudi na svojo napravo. Na voljo je tudi ločen seznam vseh znakov in posebnih simbolov.

# introTopography
source: In orientation you have a lot of learning and revision materials available. Also available separately are topographic signs, where you can learn and revise them with the help of customized exercises. Topographic signs used in the exercises are valid for the DTK25 map.
sl: Pri orientaciji imate na voljo veliko gradiva za učenje in ponavljanje. Prav tako ločeno na voljo tudi topografski znaki, kjer se jih lahko s pomočjo prilagojenih nalog tudi učite in ponavljate. Topografski znaki uporabljeni v nalogah veljajo za mapo DTK25

source: Morse code
sl: Morsejeva abeceda

source: Semaphore
sl: Semaforjeva abeceda

source: Start using the app
sl: Začni uporabljati aplikacijo

source: Translator
sl: Prevajalnik

source: Dictionary
sl: Slovar

source: Materials
sl: Materiali

source: Exercises
sl: Vaje

source: Select translation type
sl: Izberi vrsto prevoda

source: Translation
sl: Prevod

source: Input text
sl: Vnesi besedilo

source: Text
sl: Besedilo

source: Enter translation
sl: Vnesi prevod

source: Letters
sl: Črke

source: Numbers
sl: Številke

source: All
sl: Vse

source: Special characters
sl: Posebni znaki

source: Morse code alphabet
sl: Morsejeva abeceda

# morseCodeDescription
source: Morse code is a method used in telecommunication to encode text characters as sequences of two different signal durations, called dots and dashes or dits and dahses. Morse code is named after Samuel Morse, an inventor of the telegraph.
sl: Morsejeva abeceda je metoda, ki se uporablja v telekomunikacijah za kodiranje znakov besedila kot zaporedij dveh različnih trajanj signalov, imenovanih pike in črtice ali dits in dahses. Morsejeva abeceda je poimenovana po Samuelu Morseu, izumitelju telegrafa.

source: Text to Morse code
sl: Besedilo v Morsejevo abecedo

source: Morse code to text
sl: Morsejeva abeceda v besedilo

source: Start transmitting
sl: Začni oddajati

source: Stop transmitting
sl: Prenehaj z oddajanjem

source: Continuous transmission
sl: Neprekinjeno oddajanje

source: Transmitting
sl: Oddajanje

source: Receiving
sl: Prejemanje

source: Learning type
sl: Tip učenja

# sizeOfQuestion
source: Size of the question
sl: Velikost vprašanj

source: User interface
sl: Uporabniški vmesnik

source: Amount of repetitions
sl: Število ponovitev

source: Words
sl: Besede

source: Sentences
sl: Stavki

# beginLearning
source: Start learning
sl: Začni z učenjem

# cardSwipe
source: Cards
sl: Kartice

source: Keyboard
sl: Tipkovnica

source: Progress
sl: Napredek

source: Check
sl: Preveri

source: Translate the following text
sl: Prevedi sledeče besedilo

# translateTheFollowingTextDescription
source: To separate words please use /, To separate letters use space.
sl: Za ločevanje besed prosim uporabi znak /, Za ločevanje črk pa presledek.

source: Next exercise
sl: Naslednja vaja

source: Correct answer
sl: Pravilni odgovor

source: Incorrect answer
sl: Napačen odgovor

source: Partially correct answer
sl: Delno pravilen odgovor

source: Error while validating
sl: Napaka pri preverjanju

source: End of exercise
sl: Konec vaje

source: Finish exercise
sl: Končaj vajo

source: Correct answer was
sl: Pravilen odgovor je bil

source: Semaphore alphabet
sl: Semaforjeva abeceda

# semaphoreDescription
source: Semaphore is a system of sending messages by holding the arms or two flags or poles in certain positions according to an alphabetic code.
sl: Semafor je sistem pošiljanja sporočil z držanjem rok ali dveh zastavic ali palic v določenih položajih glede na abecedni kodo.

# textToSemaphore
source: Text to Semaphore (flags)
sl: Besedilo v semafor (zastavice)

# semaphoreToText
source: Semaphore (flags) to text
sl: Semafor (zastavica) v besedilo

source: Orientation
sl: Orientacija

source: Topography
sl: Topografija

source: Topography learning
sl: Učenje topografije

# topoText
source: Text
sl: Besedilo

# topoImages
source: Images
sl: Slike

# topoCategories
source: Categories
sl: Kategorije

# topoCategory
source: {selectedTopoCategory, select, geodetske_tocke{Geodetic points} morje_in_morska_obala{The sea and the sea coast} naselja_in_objekti{Settlements and facilities} promet{Traffic} rastje_in_vrste_tal{Growth and soil types} relief{Relief} vodovje{Water supply} meje_in_ograje{Borders and fences} other{Other}}
sl: {selectedTopoCategory, select, geodetske_tocke{Geodetske točke} morje_in_morska_obala{Morje in morska obala} naselja_in_objekti{Naselja in objekti} promet{Promet} rastje_in_vrste_tal{Rastje in vrste tal} relief{Relief} vodovje{Vodovje} meje_in_ograje{Meje in ograje} other{Ostalo}}

source: User
sl: Uporabnik

source: Settings
sl: Nastavitve

source: Preferences
sl: Nastavitve

# darkMode
source: Dark theme
sl: Temna tema

source: Allow notifications
sl: Dovoli obvestila

source: Permissions
sl: Dovoljenja

source: Manage
sl: Upravljaj

source: Delete data
sl: Izbriši podatke

source: About
sl: O aplikaciji

source: Translated text
sl: Prevedeno besedilo

source: Select flags
sl: Izberi zastavice
